StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_xmit.c
	if (max_bw > CHANNEL_WIDTH_40) {
		max_bw = CHANNEL_WIDTH_40;
	}

	for (bw = CHANNEL_WIDTH_20; bw <= max_bw; bw++) {
		/* RA may use lower rate for retry */
		if (rf_ctl->rate_bmp_ht_by_bw[bw] >= rate_bmp) {
			bw_bmp |= ch_width_to_bw_cap(bw);
		}
	}

exit:
	return bw_bmp;
}

u8 rtw_get_tx_bw_bmp_of_vht_rate(struct dvobj_priv *dvobj, u8 rate, u8 max_bw)
{
	struct rf_ctl_t *rf_ctl = dvobj_to_rfctl(dvobj);
	u8 bw;
	u8 bw_bmp = 0;
	u64 rate_bmp;

	if (!IS_VHT_RATE(rate)) {
		rtw_warn_on(1);
		goto exit;
	}

	rate_bmp = BIT_ULL(rate - MGN_VHT1SS_MCS0);

	if (max_bw > CHANNEL_WIDTH_160) {
		max_bw = CHANNEL_WIDTH_160;
	}

	for (bw = CHANNEL_WIDTH_20; bw <= max_bw; bw++) {
		/* RA may use lower rate for retry */
		if (rf_ctl->rate_bmp_vht_by_bw[bw] >= rate_bmp) {
			bw_bmp |= ch_width_to_bw_cap(bw);
		}
	}

exit:
	return bw_bmp;
}

s16 rtw_adapter_get_oper_txpwr_max_mbm(_adapter *adapter, bool eirp)
{
	s16 mbm = -100 * MBM_PDBM;

	if (MLME_IS_ASOC(adapter)) {
		struct mlme_ext_priv *mlmeext = &adapter->mlmeextpriv;
		u8 ch = mlmeext->cur_channel;
		u8 bw = mlmeext->cur_bwmode;
		u8 offset = mlmeext->cur_ch_offset;
		u8 cch = rtw_get_center_ch(ch, bw, offset);
		u8 hw_rate = MRateToHwRate(mlmeext->tx_rate);
		u16 bmp_cck_ofdm_by_bw[1] = {0};
		u32 bmp_ht_by_bw[2] = {0};
		u64 bmp_vht_by_bw[4] = {0};
		u16 bmp_cck_ofdm = 0;
		u32 bmp_ht = 0;
		u64 bmp_vht = 0;
		int i;

		rtw_get_adapter_tx_rate_bmp(adapter, bmp_cck_ofdm_by_bw, bmp_ht_by_bw, bmp_vht_by_bw);

		bmp_cck_ofdm |= bmp_cck_ofdm_by_bw[0];
		for (i = 0; i < 2; i++) {
			bmp_ht |= bmp_ht_by_bw[i];
		}
		for (i = 0; i < 4; i++) {
			bmp_vht |= bmp_vht_by_bw[i];
		}

		if (IS_LEGACY_HRATE(hw_rate)) {
			bmp_cck_ofdm |= BIT(hw_rate);
		} else if (IS_HT_HRATE(hw_rate)) {
			bmp_ht |= BIT(hw_rate - DESC_RATEMCS0);
		} else if (IS_VHT_HRATE(hw_rate)) {
			bmp_vht |= BIT_ULL(hw_rate - DESC_RATEVHTSS1MCS0);
		}

		mbm = phy_get_txpwr_total_max_mbm(adapter
						  , bw, cch, ch, bmp_cck_ofdm, bmp_ht, bmp_vht, 0, eirp);
	}

	return mbm;
}

s16 rtw_rfctl_get_oper_txpwr_max_mbm(struct rf_ctl_t *rfctl, u8 ch, u8 bw, u8 offset, u8 ifbmp_mod, u8 if_op, bool eirp)
{
	struct dvobj_priv *dvobj = rfctl_to_dvobj(rfctl);
	_adapter *adapter = dvobj_get_primary_adapter(dvobj);
	s16 mbm = -100 * MBM_PDBM;

	if (ch) {
		u8 cch = rtw_get_center_ch(ch, bw, offset);
		u16 bmp_cck_ofdm = 0;
		u32 bmp_ht = 0;
		u64 bmp_vht = 0;
		int i;

		for (i = 0; i < dvobj->iface_nums; i++) {
			struct mlme_ext_priv *mlmeext;
			u8 hw_rate;

			if (!dvobj->padapters[i]) {
				continue;
			}

			if (ifbmp_mod & BIT(i)) {
				if (!if_op) {
					continue;
				}
			} else if (!MLME_IS_ASOC(dvobj->padapters[i])) {
				continue;
			}

			mlmeext = &(dvobj->padapters[i]->mlmeextpriv);
			hw_rate = MRateToHwRate(mlmeext->tx_rate);

			if (IS_LEGACY_HRATE(hw_rate)) {
				bmp_cck_ofdm |= BIT(hw_rate);
			} else if (IS_HT_HRATE(hw_rate)) {
				bmp_ht |= BIT(hw_rate - DESC_RATEMCS0);
			} else if (IS_VHT_HRATE(hw_rate)) {
				bmp_vht |= BIT_ULL(hw_rate - DESC_RATEVHTSS1MCS0);
			}
		}

		bmp_cck_ofdm |= rfctl->rate_bmp_cck_ofdm;
		for (i = 0; i < 2; i++) {
			bmp_ht |= rfctl->rate_bmp_ht_by_bw[i];
		}
		for (i = 0; i < 4; i++) {
			bmp_vht |= rfctl->rate_bmp_vht_by_bw[i];
		}

		mbm = phy_get_txpwr_total_max_mbm(adapter
						  , bw, cch, ch, bmp_cck_ofdm, bmp_ht, bmp_vht, 0, eirp);
	}

	return mbm;
}

s16 rtw_get_oper_txpwr_max_mbm(struct dvobj_priv *dvobj, bool eirp)
{
	struct rf_ctl_t *rfctl = dvobj_to_rfctl(dvobj);
	_adapter *adapter = dvobj_get_primary_adapter(dvobj);
	s16 mbm = -100 * MBM_PDBM;
	u8 ch = rfctl->op_ch, bw, offset;

	if (rtw_get_bw_offset_by_op_class_ch(rfctl->op_class, ch, &bw, &offset)) {
		mbm = rtw_rfctl_get_oper_txpwr_max_mbm(rfctl, ch, bw, offset, 0, 0, eirp);
	}

	return mbm;
}

s16 rtw_rfctl_get_reg_max_txpwr_mbm(struct rf_ctl_t *rfctl, u8 ch, u8 bw, u8 offset, bool eirp)
{
	struct dvobj_priv *dvobj = rfctl_to_dvobj(rfctl);
	struct registry_priv *regsty = dvobj_to_regsty(dvobj);
	_adapter *adapter = dvobj_get_primary_adapter(dvobj);
	s16 mbm = -100 * MBM_PDBM;
	u8 cch = rtw_get_center_ch(ch, bw, offset);
	u16 bmp_cck_ofdm = 0;
	u32 bmp_ht = 0;
	u64 bmp_vht = 0;

	if (ch <= 14) {
		bmp_cck_ofdm |= RATE_BMP_CCK;
	}

	/* TODO: NO OFDM? */
	bmp_cck_ofdm |= RATE_BMP_OFDM;

#ifdef CONFIG_80211N_HT
	if (regsty->ht_enable && is_supported_ht(regsty->wireless_mode)) {
		switch (GET_HAL_TX_NSS(adapter)) {
		case 1:
			bmp_ht |= RATE_BMP_HT_1SS;
			break;
		case 2:
			bmp_ht |= RATE_BMP_HT_2SS | RATE_BMP_HT_1SS;
			break;
		case 3:
			bmp_ht |= RATE_BMP_HT_3SS | RATE_BMP_HT_2SS | RATE_BMP_HT_1SS;
			break;
		case 4:
			bmp_ht |= RATE_BMP_HT_4SS | RATE_BMP_HT_3SS | RATE_BMP_HT_2SS | RATE_BMP_HT_1SS;
			break;
		default:
			rtw_warn_on(1);
		}
	}
#endif

#ifdef CONFIG_80211AC_VHT
	if (ch > 14 && REGSTY_IS_11AC_ENABLE(regsty) && is_supported_vht(regsty->wireless_mode)
	    && RFCTL_REG_EN_11AC(rfctl)
	   ) {
		switch (GET_HAL_TX_NSS(adapter)) {
		case 1:
			bmp_vht |= RATE_BMP_VHT_1SS;
			break;
		case 2:
			bmp_vht |= RATE_BMP_VHT_2SS | RATE_BMP_VHT_1SS;
			break;
		case 3:
			bmp_vht |= RATE_BMP_VHT_3SS | RATE_BMP_VHT_2SS | RATE_BMP_VHT_1SS;
			break;
		case 4:
			bmp_vht |= RATE_BMP_VHT_4SS | RATE_BMP_VHT_3SS | RATE_BMP_VHT_2SS | RATE_BMP_VHT_1SS;
			break;
		default:
			rtw_warn_on(1);
		}
	}
#endif

	mbm = phy_get_txpwr_total_max_mbm(adapter
					  , bw, cch, ch, bmp_cck_ofdm, bmp_ht, bmp_vht, 1, eirp);

	return mbm;
}

u8 query_ra_short_GI(struct sta_info *psta, u8 bw)
{
	u8	sgi = _FALSE, sgi_20m = _FALSE, sgi_40m = _FALSE, sgi_80m = _FALSE;

#ifdef CONFIG_80211N_HT
#ifdef CONFIG_80211AC_VHT
	if (psta->vhtpriv.vht_option) {
		sgi_80m = psta->vhtpriv.sgi_80m;
	}
#endif
	sgi_20m = psta->htpriv.sgi_20m;
	sgi_40m = psta->htpriv.sgi_40m;
#endif

	switch (bw) {
	case CHANNEL_WIDTH_80:
		sgi = sgi_80m;
		break;
	case CHANNEL_WIDTH_40:
		sgi = sgi_40m;
		break;
	case CHANNEL_WIDTH_20:
	default:
		sgi = sgi_20m;
		break;
	}

	return sgi;
}

/* This function references driver insmond parameters to decide vcs mode. */
/* Driver insmond parameters: rtw_vrtl_carrier_sense and rtw_vcs_type */
static u8 validate_vcs(_adapter *padapter, u8  mode)
{

	u8 vcs_mode = NONE_VCS;

	switch (padapter->registrypriv.vrtl_carrier_sense) {

	case DISABLE_VCS:
		vcs_mode = NONE_VCS;
		break;

