StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_xmit.c
		/* For WPS 1.0 WEP, driver should not encrypt EAPOL Packet for WPS handshake. */
		if (((pattrib->encrypt == _WEP40_) || (pattrib->encrypt == _WEP104_)) && (pattrib->ether_type == 0x888e)) {
			pattrib->encrypt = _NO_PRIVACY_;
		}

	}

#ifdef CONFIG_TDLS
	if (pattrib->direct_link == _TRUE) {
		if (pattrib->encrypt > 0) {
			pattrib->encrypt = _AES_;
		}
	}
#endif

	switch (pattrib->encrypt) {
	case _WEP40_:
	case _WEP104_:
		pattrib->iv_len = 4;
		pattrib->icv_len = 4;
		WEP_IV(pattrib->iv, psta->dot11txpn, pattrib->key_idx);
		break;

	case _TKIP_:
		pattrib->iv_len = 8;
		pattrib->icv_len = 4;

		if (psecuritypriv->busetkipkey == _FAIL) {
#ifdef DBG_TX_DROP_FRAME
			RTW_INFO("DBG_TX_DROP_FRAME %s psecuritypriv->busetkipkey(%d)==_FAIL drop packet\n", __FUNCTION__, psecuritypriv->busetkipkey);
#endif
			res = _FAIL;
			goto exit;
		}

		if (bmcast) {
			TKIP_IV(pattrib->iv, psta->dot11txpn, pattrib->key_idx);
		} else {
			TKIP_IV(pattrib->iv, psta->dot11txpn, 0);
		}


		_rtw_memcpy(pattrib->dot11tkiptxmickey.skey, psta->dot11tkiptxmickey.skey, 16);

		break;

	case _AES_:

		pattrib->iv_len = 8;
		pattrib->icv_len = 8;

		if (bmcast) {
			AES_IV(pattrib->iv, psta->dot11txpn, pattrib->key_idx);
		} else {
			AES_IV(pattrib->iv, psta->dot11txpn, 0);
		}

		break;

	case _GCMP_:
	case _GCMP_256_:

		pattrib->iv_len = 8;
		pattrib->icv_len = 16;

		if (bmcast) {
			GCMP_IV(pattrib->iv, psta->dot11txpn, pattrib->key_idx);
		} else {
			GCMP_IV(pattrib->iv, psta->dot11txpn, 0);
		}

		break;

	case _CCMP_256_:

		pattrib->iv_len = 8;
		pattrib->icv_len = 16;

		if (bmcast) {
			GCMP_IV(pattrib->iv, psta->dot11txpn, pattrib->key_idx);
		} else {
			GCMP_IV(pattrib->iv, psta->dot11txpn, 0);
		}

		break;

#ifdef CONFIG_WAPI_SUPPORT
	case _SMS4_:
		pattrib->iv_len = 18;
		pattrib->icv_len = 16;
		rtw_wapi_get_iv(padapter, pattrib->ra, pattrib->iv);
		break;
#endif
	default:
		pattrib->iv_len = 0;
		pattrib->icv_len = 0;
		break;
	}

	if (pattrib->encrypt > 0) {
		_rtw_memcpy(pattrib->dot118021x_UncstKey.skey
			    , psta->dot118021x_UncstKey.skey
			    , (pattrib->encrypt & _SEC_TYPE_256_) ? 32 : 16);
	}


	if (pattrib->encrypt &&
	    ((padapter->securitypriv.sw_encrypt == _TRUE) || (psecuritypriv->hw_decrypted == _FALSE))) {
		pattrib->bswenc = _TRUE;
	} else {
		pattrib->bswenc = _FALSE;
	}

	pattrib->bmc_camid = padapter->securitypriv.dot118021x_bmc_cam_id;

	if (pattrib->encrypt && bmcast && _rtw_camctl_chk_flags(padapter, SEC_STATUS_STA_PK_GK_CONFLICT_DIS_BMC_SEARCH)) {
		pattrib->bswenc = _TRUE;
	}

#ifdef CONFIG_WAPI_SUPPORT
	if (pattrib->encrypt == _SMS4_) {
		pattrib->bswenc = _FALSE;
	}
#endif

	if ((pattrib->encrypt) && (eapol_type == EAPOL_4_4)) {
		pattrib->bswenc = _TRUE;
	}

exit:

	return res;

}

u8	qos_acm(u8 acm_mask, u8 priority)
{
	u8	change_priority = priority;

	switch (priority) {
	case 0:
	case 3:
		if (acm_mask & BIT(1)) {
			change_priority = 1;
		}
		break;
	case 1:
	case 2:
		break;
	case 4:
	case 5:
		if (acm_mask & BIT(2)) {
			change_priority = 0;
		}
		break;
	case 6:
	case 7:
		if (acm_mask & BIT(3)) {
			change_priority = 5;
		}
		break;
	default:
		RTW_INFO("qos_acm(): invalid pattrib->priority: %d!!!\n", priority);
		break;
	}

	return change_priority;
}

/* refer to IEEE802.11-2016 Table R-3; Comply with IETF RFC4594 */
static u8 tos_to_up(u8 tos)
{
	u8 up = 0;
	u8 dscp;
	u8 mode = CONFIG_RTW_UP_MAPPING_RULE;


	/* tos precedence mapping */
	if (mode == 0) {
		up = tos >> 5;
		return up;
	}

	/* refer to IEEE802.11-2016 Table R-3;
	 * DCSP 32(CS4) comply with IETF RFC4594
	 */
	dscp = (tos >> 2);

	if (dscp == 0) {
		up = 0;
	} else if (dscp >= 1 && dscp <= 9) {
		up = 1;
	} else if (dscp >= 10 && dscp <= 16) {
		up = 2;
	} else if (dscp >= 17 && dscp <= 23) {
		up = 3;
	} else if (dscp >= 24 && dscp <= 31) {
		up = 4;
	} else if (dscp >= 33 && dscp <= 40) {
		up = 5;
	} else if ((dscp >= 41 && dscp <= 47) || (dscp == 32)) {
		up = 6;
	} else if (dscp >= 48 && dscp <= 63) {
		up = 7;
	}

	return up;
}

static void set_qos(_pkt *pkt, struct pkt_attrib *pattrib)
{
	s32 UserPriority = 0;

	if (!pkt) {
		goto null_pkt;
	}

	/* get UserPriority from IP hdr */
	if (pattrib->ether_type == 0x0800) {
		struct pkt_file ppktfile;
		struct ethhdr etherhdr;
		struct iphdr ip_hdr;

		_rtw_open_pktfile(pkt, &ppktfile);
		_rtw_pktfile_read(&ppktfile, (unsigned char *)&etherhdr, ETH_HLEN);
		_rtw_pktfile_read(&ppktfile, (u8 *)&ip_hdr, sizeof(ip_hdr));
		/*		UserPriority = (ntohs(ip_hdr.tos) >> 5) & 0x3; */
		UserPriority = tos_to_up(ip_hdr.tos);
	}
	/*
		else if (pattrib->ether_type == 0x888e) {


			UserPriority = 7;
		}
	*/

#ifdef CONFIG_ICMP_VOQ
	if (pattrib->icmp_pkt == 1) { /*use VO queue to send icmp packet*/
		UserPriority = 7;
	}
#endif
#ifdef CONFIG_IP_R_MONITOR
	if (pattrib->ether_type == ETH_P_ARP) {
		UserPriority = 7;
	}
#endif/*CONFIG_IP_R_MONITOR*/

null_pkt:
	pattrib->priority = UserPriority;
	pattrib->hdrlen = XATTRIB_GET_WDS(pattrib) ? WLAN_HDR_A4_QOS_LEN : WLAN_HDR_A3_QOS_LEN;
	pattrib->subtype = WIFI_QOS_DATA_TYPE;
}

#ifdef CONFIG_TDLS
u8 rtw_check_tdls_established(_adapter *padapter, struct pkt_attrib *pattrib)
{
	pattrib->ptdls_sta = NULL;

	pattrib->direct_link = _FALSE;
	if (padapter->tdlsinfo.link_established == _TRUE) {
		pattrib->ptdls_sta = rtw_get_stainfo(&padapter->stapriv, pattrib->dst);
#if 1
		if ((pattrib->ptdls_sta != NULL) &&
		    (pattrib->ptdls_sta->tdls_sta_state & TDLS_LINKED_STATE) &&
		    (pattrib->ether_type != 0x0806)) {
			pattrib->direct_link = _TRUE;
			/* RTW_INFO("send ptk to "MAC_FMT" using direct link\n", MAC_ARG(pattrib->dst)); */
		}
#else
		if (pattrib->ptdls_sta != NULL &&
		    pattrib->ptdls_sta->tdls_sta_state & TDLS_LINKED_STATE) {
			pattrib->direct_link = _TRUE;
#if 0
			RTW_INFO("send ptk to "MAC_FMT" using direct link\n", MAC_ARG(pattrib->dst));
#endif
		}

		/* ARP frame may be helped by AP*/
		if (pattrib->ether_type != 0x0806) {
			pattrib->direct_link = _FALSE;
		}
#endif
	}

	return pattrib->direct_link;
}

