StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_xmit.c
#ifdef CONFIG_RTW_MESH
		if (MLME_IS_MESH(padapter)) {
			res = rtw_mesh_addr_resolve(padapter, os_qid, pxmitframe, *ppkt, &f_list);
		} else
#endif
			res = rtw_ap_addr_resolve(padapter, os_qid, pxmitframe, *ppkt, &f_list);
		if (res == RTW_RA_RESOLVING) {
			return 1;
		}
		if (res == _FAIL) {
			return -1;
		}

#if defined(CONFIG_RTW_WDS) || CONFIG_RTW_DATA_BMC_TO_UC
		if (!rtw_is_list_empty(&f_list)) {
			_list *list = get_next(&f_list);
			struct xmit_frame *fframe;

			while ((rtw_end_of_queue_search(&f_list, list)) == _FALSE) {
				fframe = LIST_CONTAINOR(list, struct xmit_frame, list);
				list = get_next(list);
				rtw_list_delete(&fframe->list);

				if (res == RTW_ORI_NO_NEED && rtw_is_list_empty(&f_list)) {
					fframe->pkt = pxmitframe->pkt; /* last frame */
					pxmitframe->pkt = NULL;
				} else {
					fframe->pkt = rtw_os_pkt_copy(*ppkt);
				}

				if (!fframe->pkt) {
					if (res == RTW_ORI_NO_NEED && IS_MCAST(pxmitframe->attrib.dst)) {
						res = _SUCCESS;
					}
					rtw_free_xmitframe(pxmitpriv, fframe);
					continue;
				}

				rtw_xmit_posthandle(padapter, fframe, fframe->pkt);
			}
		}
#endif

		if (res == RTW_ORI_NO_NEED) {
			rtw_free_xmitframe(&padapter->xmitpriv, pxmitframe);
			return 0;
		}
	}
#endif /* defined(CONFIG_AP_MODE) || defined(CONFIG_RTW_MESH) */

	pxmitframe->pkt = NULL; /* let rtw_xmit_posthandle not to free pkt inside */
	res = rtw_xmit_posthandle(padapter, pxmitframe, *ppkt);

	return res;
}

#ifdef CONFIG_TDLS
sint xmitframe_enqueue_for_tdls_sleeping_sta(_adapter *padapter, struct xmit_frame *pxmitframe)
{
	sint ret = _FALSE;

	_irqL irqL;
	struct sta_info *ptdls_sta = NULL;
	struct sta_priv *pstapriv = &padapter->stapriv;
	struct pkt_attrib *pattrib = &pxmitframe->attrib;
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	int i;

	ptdls_sta = rtw_get_stainfo(pstapriv, pattrib->dst);
	if (ptdls_sta == NULL) {
		return ret;
	} else if (ptdls_sta->tdls_sta_state & TDLS_LINKED_STATE) {

		if (pattrib->triggered == 1) {
			ret = _TRUE;
			return ret;
		}

		_enter_critical_bh(&ptdls_sta->sleep_q.lock, &irqL);

		if (ptdls_sta->state & WIFI_SLEEP_STATE) {
			rtw_list_delete(&pxmitframe->list);

			/* _enter_critical_bh(&psta->sleep_q.lock, &irqL);	 */

			rtw_list_insert_tail(&pxmitframe->list, get_list_head(&ptdls_sta->sleep_q));

			ptdls_sta->sleepq_len++;
			ptdls_sta->sleepq_ac_len++;

			/* indicate 4-AC queue bit in TDLS peer traffic indication */
			switch (pattrib->priority) {
			case 1:
			case 2:
				ptdls_sta->uapsd_bk |= BIT(1);
				break;
			case 4:
			case 5:
				ptdls_sta->uapsd_vi |= BIT(1);
				break;
			case 6:
			case 7:
				ptdls_sta->uapsd_vo |= BIT(1);
				break;
			case 0:
			case 3:
			default:
				ptdls_sta->uapsd_be |= BIT(1);
				break;
			}

			/* Transmit TDLS PTI via AP */
			if (ptdls_sta->sleepq_len == 1) {
				rtw_tdls_cmd(padapter, ptdls_sta->cmn.mac_addr, TDLS_ISSUE_PTI);
			}

			ret = _TRUE;
		}

		_exit_critical_bh(&ptdls_sta->sleep_q.lock, &irqL);
	}

	return ret;

}
#endif /* CONFIG_TDLS */

#define RTW_HIQ_FILTER_ALLOW_ALL 0
#define RTW_HIQ_FILTER_ALLOW_SPECIAL 1
#define RTW_HIQ_FILTER_DENY_ALL 2

inline bool xmitframe_hiq_filter(struct xmit_frame *xmitframe)
{
	bool allow = _FALSE;
	_adapter *adapter = xmitframe->padapter;
	struct registry_priv *registry = &adapter->registrypriv;

	if (adapter->registrypriv.wifi_spec == 1) {
		allow = _TRUE;
	} else if (registry->hiq_filter == RTW_HIQ_FILTER_ALLOW_SPECIAL) {

		struct pkt_attrib *attrib = &xmitframe->attrib;

		if (attrib->ether_type == 0x0806
		    || attrib->ether_type == 0x888e
#ifdef CONFIG_WAPI_SUPPORT
		    || attrib->ether_type == 0x88B4
#endif
		    || attrib->dhcp_pkt
		   ) {
			if (0)
				RTW_INFO(FUNC_ADPT_FMT" ether_type:0x%04x%s\n", FUNC_ADPT_ARG(xmitframe->padapter)
					 , attrib->ether_type, attrib->dhcp_pkt ? " DHCP" : "");
			allow = _TRUE;
		}
	} else if (registry->hiq_filter == RTW_HIQ_FILTER_ALLOW_ALL) {
		allow = _TRUE;
	} else if (registry->hiq_filter == RTW_HIQ_FILTER_DENY_ALL) {
		allow = _FALSE;
	} else {
		rtw_warn_on(1);
	}

	return allow;
}

#if defined(CONFIG_AP_MODE) || defined(CONFIG_TDLS)
#ifdef CONFIG_RTW_MGMT_QUEUE
u8 mgmt_xmitframe_enqueue_for_sleeping_sta(_adapter *padapter, struct xmit_frame *pxmitframe)
{
	_irqL irqL;
	struct pkt_attrib *pattrib = &pxmitframe->attrib;
	struct sta_info *psta = pattrib->psta;
	struct sta_priv *pstapriv = &padapter->stapriv;
	bool update_tim = _FALSE;
	u8 ret = _TRUE;

	if (is_broadcast_mac_addr(pattrib->ra) || pattrib->ps_dontq) {
		return _FALSE;
	}

	if (psta == NULL) {
		RTW_INFO("%s, psta==NUL don't need enqueue, pattrib->ra:"MAC_FMT"\n",
			 __func__, MAC_ARG(pattrib->ra));
		return _FALSE;
	}

	if (!(psta->state & WIFI_ASOC_STATE)) {
		DBG_COUNTER(padapter->tx_logs.core_tx_ap_enqueue_warn_link);
		RTW_INFO("%s, psta->state(0x%x) != WIFI_ASOC_STATE\n", __func__, psta->state);
		return _FALSE;
	}

	_enter_critical_bh(&psta->mgmt_sleep_q.lock, &irqL);

	if (psta->state & WIFI_SLEEP_STATE &&
	    rtw_tim_map_is_set(padapter, pstapriv->sta_dz_bitmap, psta->cmn.aid)) {

		rtw_list_delete(&pxmitframe->list);
		rtw_list_insert_tail(&pxmitframe->list, get_list_head(&psta->mgmt_sleep_q));
		psta->mgmt_sleepq_len++;

#ifdef DBG_MGMT_QUEUE
		RTW_INFO("%s attrib->ra:"MAC_FMT" seq_num = %u, subtype = 0x%x\n",
			 __func__, MAC_ARG(pattrib->ra), pattrib->seqnum, pattrib->subtype);
#endif

		if (!(rtw_tim_map_is_set(padapter, pstapriv->tim_bitmap, psta->cmn.aid))) {
			update_tim = _TRUE;
		}

		rtw_tim_map_set(padapter, pstapriv->tim_bitmap, psta->cmn.aid);

		/* upate BCN for TIM IE */
		if (update_tim == _TRUE) {
			_update_beacon(padapter, _TIM_IE_, NULL, _TRUE, 0, "buffer mgmt frame");
		}

		ret = RTW_QUEUE_MGMT;
		DBG_COUNTER(padapter->tx_logs.core_tx_ap_enqueue_ucast);
	}

	_exit_critical_bh(&psta->mgmt_sleep_q.lock, &irqL);

	return ret;
}

static void dequeue_mgmt_xmitframe_to_sleepq(_adapter *padapter, struct sta_info *psta, _queue *pframequeue)
{
	sint ret;
	_list	*plist, *phead;
	struct tx_servq *ptxservq;
	struct pkt_attrib *pattrib;
	struct xmit_frame *pxmitframe;
	struct xmit_priv *pxmitpriv = &(padapter->xmitpriv);
	struct hw_xmit *phwxmits = pxmitpriv->hwxmits;
	u8 mgmt_idx = pxmitpriv->hwxmit_entry - 1;

	phead = get_list_head(pframequeue);
	plist = get_next(phead);

	while (rtw_end_of_queue_search(phead, plist) == _FALSE) {
		pxmitframe = LIST_CONTAINOR(plist, struct xmit_frame, list);
		plist = get_next(plist);

		pattrib = &pxmitframe->attrib;
		pattrib->triggered = 0;

		ret = mgmt_xmitframe_enqueue_for_sleeping_sta(padapter, pxmitframe);

		if (ret == RTW_QUEUE_MGMT) {
			ptxservq = &(psta->sta_xmitpriv.mgmt_q);
			ptxservq->qcnt--;
			phwxmits[mgmt_idx].accnt--;
		} else {
			/* RTW_INFO("xmitframe_enqueue_for_sleeping_sta return _FALSE\n"); */
		}
	}
}
#endif

sint xmitframe_enqueue_for_sleeping_sta(_adapter *padapter, struct xmit_frame *pxmitframe)
{
	_irqL irqL;
	sint ret = _FALSE;
	struct sta_info *psta = NULL;
	struct sta_priv *pstapriv = &padapter->stapriv;
	struct pkt_attrib *pattrib = &pxmitframe->attrib;
	sint bmcst = IS_MCAST(pattrib->ra);
	bool update_tim = _FALSE;
#ifdef CONFIG_TDLS

	if (padapter->tdlsinfo.link_established == _TRUE) {
		ret = xmitframe_enqueue_for_tdls_sleeping_sta(padapter, pxmitframe);
	}
#endif /* CONFIG_TDLS */

	if (!MLME_IS_AP(padapter) && !MLME_IS_MESH(padapter)) {
		DBG_COUNTER(padapter->tx_logs.core_tx_ap_enqueue_warn_fwstate);
		return ret;
	}
	/*
		if(pattrib->psta)
		{
			psta = pattrib->psta;
		}
		else
		{
			RTW_INFO("%s, call rtw_get_stainfo()\n", __func__);
			psta=rtw_get_stainfo(pstapriv, pattrib->ra);
		}
	*/
	psta = rtw_get_stainfo(&padapter->stapriv, pattrib->ra);
	if (pattrib->psta != psta) {
		DBG_COUNTER(padapter->tx_logs.core_tx_ap_enqueue_warn_sta);
		RTW_INFO("%s, pattrib->psta(%p) != psta(%p)\n", __func__, pattrib->psta, psta);
		return _FALSE;
	}

